[Necropolis.A_Necromante_bonus H7TownGrowthEnhancer]
mName="白骨祭坛"
mDesc="精英生物住所升级。\n每周+2骸骨祭司或墓穴先知的产量。"

[Necropolis.A_NecropolisNecromante H7TownDwelling]
mName="亡者祭坛"
mDesc="精英生物住所。\n允许招募骸骨祭司，周产量为2。"

[Necropolis.A_NecropolisNecromante_2 H7TownDwelling]
mName="亡者宫殿"
mDesc="精英生物升级住所。\n允许招募并将骸骨祭司升级为墓穴先知。\n(基础增长：2/周)"

[Stronghold.A_Strongholdeaglebonusgrowth H7TownGrowthEnhancer]
mName="鹰巢"
mDesc="精英生物住所升级。\n每周+7巨鹰或雷鸟的产量。"

[Stronghold.A_StrongholdThunderBirdCavern H7TownDwelling]
mName="巨鹰山"
mDesc="精英生物住所。\n允许招募巨鹰，周产量为7。"

[Stronghold.A_StrongholdThunderBirdsupNoMansLand H7TownDwelling]
mName="风暴之巅"
mDesc="精英生物升级住所。\n允许招募并将巨鹰升级为雷鸟。\n(基础增长：7/周)"

[Sylvan.A_Sylvan_Centaure_base H7TownDwelling]
mName="马术森林"
mDesc="精英生物住所。\n允许招募半人马战士，周产量为7。"

[Sylvan.A_Sylvan_centaure_lv2 H7TownDwelling]
mName="长老草甸"
mDesc="精英生物升级住所。\n允许招募并将半人马战士升级为长老半人马。\n(基础增长：7/周)"

[Academy.A_Academy_alt_pool H7TownGrowthEnhancer]
mName="精神之塔"
mDesc="精英生物住所升级。\n每周+2精神元素或精神秘法师的产量。"

[Academy.A_Academy_Spirit_2 H7TownDwelling]
mName="精神居所"
mDesc="精英生物住所。\n允许招募精神元素，周产量为2。"

[Academy.A_Academy_Spirit_1 H7TownDwelling]
mName="精神深坑"
mDesc="精英生物升级住所。\n允许招募并将精神元素升级为精神秘法师。\n(基础增长：2/周)"

[Fortress.A_Fortress_Goleme_fire_lv1 H7TownDwelling]
mName="沉睡火山口"
mDesc="精英生物住所。\n允许招募硫磺魔像，周产量为5。"

[Fortress.A_Fortress_Goleme_fire_lv2 H7TownDwelling]
mName="火山池"
mDesc="精英生物升级住所。\n允许招募并将硫磺魔像升级为火山魔像。\n(基础增长：5/周)"

[tower.A_Frost__t6_alt_bonus_production H7TownGrowthEnhancer]
mName="雪林"
mDesc="精英生物住所升级。\n每周+2剑齿虎或霜齿虎的产量。"

[tower.A_frost_t6_alt_base H7TownDwelling]
mName="剑齿虎巢穴"
mDesc="精英生物住所。\n允许招募剑齿虎，周产量为2。"

[tower.A_frost_t6_alt_upragate H7TownDwelling]
mName="霜齿虎巢穴"
mDesc="精英生物升级住所。\n允许招募并将剑齿虎升级为霜齿虎。\n(基础增长：2/周)"

[Xel.A_Xel_alt_1 H7TownDwelling]
mName="梦魇兽穴"
mDesc="核心生物住所。\n允许招募秽龙，周产量为13。"

[Xel.A_Xel_alt_2 H7TownDwelling]
mName="剧毒猎犬"
mDesc="核心生物升级住所。\n允许招募并将秽龙升级为剧毒秽龙。\n(基础增长：13/周)"

[Xel.A_Xel_alt_add H7TownGrowthEnhancer]
mName="秽龙孵化所"
mDesc="核心生物住所升级。\n每周+5秽龙或剧毒秽龙的产量。"

[Temple.A_temple_t6_alt_growht H7TownGrowthEnhancer]
mName="汹涌之水"
mDesc="精英生物住所升级。\n每周+2重鳄或恐鳄的产量。"

[Temple.A_temple_alt_upr_t6 H7TownDwelling]
mName="化石池塘"
mDesc="精英生物升级住所。\n允许招募并将重鳄升级为恐鳄。\n(基础增长：2/周)"

[Temple.A_temple_alt_base_t6 H7TownDwelling]
mName="化石沼泽"
mDesc="精英生物住所。\n允许招募重鳄，周产量为2。"

[Sanctuary.A_Sanctuary_t5_upragate_alt H7TownDwelling]
mName="风暴之柱"
mDesc="精英生物升级住所。\n允许招募并将灵猴升级为灵猴王。\n(基础增长：5/周)"

[Sanctuary.A_sanctuary_t5_alt H7TownDwelling]
mName="风之树"
mDesc="精英生物住所。\n允许招募灵猴，周产量为5。"

v1.37

[Inferno.A_hadess_growth H7TownGrowthEnhancer]
mName="烈焰群落"
mDesc="精英生物住所升级。\n每周+2地狱蜘蛛和深渊狼蛛的产量。"

[Inferno.A_inferno_alternative_lv2 H7TownDwelling]
mName="深渊蜘蛛巢穴"
mDesc="精英生物升级住所。\n允许招募并将地狱蜘蛛升级为深渊狼蛛。\n(基础增长：6/周)"

[Inferno.A_inferno_alternative_base H7TownDwelling]
mName="恶魔之茧"
mDesc="精英生物住所。\n允许招募地狱蜘蛛，周产量为6。"